# SQL 4 Data Science: Predict Project
## Bhejane Online Trading Store

### Student Starter Notebook

© Explore Data Science Academy

### Honour Code

I {**YOUR NAME**, **YOUR SURNAME**}, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

<a id='Context'></a>
### 1. Context

<div align="center" style="width: 600px; font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/Bhejane_large.jpg"
     alt="The Black Rhino"
     style="float: center; padding-bottom=0.5em"
     width=600px/>
     Bhejane, or the Black Rhino. Image by <a href="https://commons.wikimedia.org/wiki/File:Black_Rhino_(Diceros_bicornis)_browsing_..._(46584052962).jpg">Wikimedia Commons</a>
</div>


The Bhejane trading store is an online retailer specialising in Covid essesstial items. The store has recently be struggling with the management of its database-related inventory system. Luckily for them, you've been hired as a consultant to fix the problem. 

Its time to flex your Ninja SQL skills! 
 
**Your mission, should you choose to accept it:**

You will receive a denormalised database consisting of two tables. Your task is to transform the database such that is in third normal form (3NF). To ensure that a consistent normalisation process is followed by each student, we have attached an Entity Relationship Diagram (ERD) which is a guideline on what tables need to be produced. Once you have normalised the databasse, you will be required to complete an MCQ test found under the 'Predict' tab of Athena.

<a id='Imports'></a>
### 2. Imports
Please use the below command to install sql_magic, this is the package that will assist you with SQL syntax hightlighting.
* pip install sql_magic

Remember to start each new cell with " %%read_sql "

In [1]:
# DO NOT EDIT THIS CELL
import sqlite3
import csv
from sqlalchemy import create_engine
%load_ext sql_magic

# Load SQLite database
engine  = create_engine("sqlite:///bhejane.db")
%config SQL.conn_name ='engine'

<a id='Data_description'></a>
### 3. Data description

The original database consist of 2 tables. 
* Product Table
* Transaction Table

In [2]:
# DO NOT EDIT THIS CELL
import pandas as pd
data_description = pd.read_excel('Data Description.xlsx')
data_description

,Table Name,Column Name,Desciption
0,Products,Width,Width of the product once assembled
1,Products,Length,Length of the product once assembled
2,Products,Height,Height of the product once assembled
3,Products,Barcode,The unique product identifier
4,Products,Quantity,Number of goods in stock
5,Products,Brand,Product brand name relating to product company
6,Products,NavigationPath,Navigation path to specific product
7,Products,Colour,Name default colour for the product
8,Products,StockCountry,Country where the stock was bought from
9,Products,ProductDescription,Descriptive product name
10,Products,PackType,The way in which the product is packaged
11,Products,Volume_litre,The quantity of liquid based products
12,Products,Warranty,Product warranty type
13,Products,Weight_kg,Weight of the product
14,Products,ItemDescription,Description of contents of the package
15,Products,Price,The cost of the product in Rands
16,Transactions,CartID,Identifies an individual basket from a user pu...
17,Transactions,Barcode,Barcode for item that user purchased
18,Transactions,Total,Total value of a transaction
19,Transactions,UserName,Name of customer purchasing stock
20,Transactions,InvoiceDate,Date on which the product was bought

<a id='Setting_up'></a>
### 4. Setting up the database

In [2]:
#DO NOT EDIT THIS CELL
conn = sqlite3.connect('bhejane.db')
cursor = conn.cursor()

#### Creating both Products and Transaction Tables

In [5]:
%%read_sql
--DO NOT EDIT THIS CELL
DROP TABLE IF EXISTS "Products";
DROP TABLE IF EXISTS "Transactions";

CREATE TABLE "Products" (
    "Width"   REAL,
    "Length"  REAL,
    "Height"  REAL,
    "Barcode" VARCHAR(150) NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "Brand" VARCHAR(150), 
    "NavigationPath" VARCHAR(150),
    "Colour" VARCHAR(150),
    "StockCountry" VARCHAR(150),
    "ProductDescription" VARCHAR(150) NOT NULL,
    "PackType" VARCHAR(150), 
    "Volume_litre" REAL, 
    "Warranty" VARCHAR(150), 
    "Weight_kg" REAL,
    "ItemDescription" VARCHAR(150), 
    "Price" REAL
);


CREATE TABLE "Transactions" (
    "CartID" INTEGER,
    "Barcode" VARCHAR(150), 
    "Total" REAL,
    "UserName" VARCHAR(150), 
    "InvoiceDate" DATETIME
);

Query started at 05:07:06 PM SAST; Query executed in 0.00 m

#### Load Data into Product and Transaction tables

In [6]:
# DO NOT EDIT CELL
# Load data into Product table
with open('bhejane_covid_essentials_Products.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['Width'],i['Length'],i['Height'], i['Barcode'], i['Quantity'], i['Brand'], i['NavigationPath'], i['Colour'], i['StockCountry'], i['ProductDescription'],i['PackType'],i['Volume_litre'],i['Warranty'],i['Weight_kg'],i["ItemDescription"],i['Price']) for i in dr]

cursor.executemany("INSERT INTO Products VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);", to_db)
conn.commit()

with open('bhejane_covid_essentials_Transactions.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['CartID'],i['Barcode'], i['Total'], i['UserName'], i['InvoiceDate']) for i in dr]

cursor.executemany("INSERT INTO Transactions VALUES (?, ?, ?, ?, ?);", to_db)
conn.commit()

<a id='ERD'></a>
### 5. Denormalized Database Tables


<br>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/Denormalized_Tables.png" alt="Denormalized Tables" border="0">

#### 5.1 Explore the Denormalized Tables
Familiarize yourself with the data given in the two tables by writing your own SQL queries to explore properties of the dataset.i.e Look for data inconsistencies, anormalies, redundancies etc to guide your normalization process. 

This section will not be graded - think of it as your own scratch pad.

In [17]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT distinct Barcode,NavigationPath,ItemDescription,ProductDescription,Brand,
       Price,Quantity,PackType,Warranty,StockCountry,Colour,Weight_kg,
       Volume_litre,Length,Width,Height
       
from Products

--LIMIT 2;

Query started at 05:24:29 PM SAST; Query executed in 0.00 m

,Barcode,NavigationPath,ItemDescription,ProductDescription,Brand,Price,Quantity,PackType,Warranty,StockCountry,Colour,Weight_kg,Volume_litre,Length,Width,Height
0,300507946,Computers & Tablets / Smart Home & Connected L...,1 x Hikvision 1080P Bullet camera,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,Hikvision,399.0,493,,Limited (6 months),,,,0.0,,,
1,300507946,Computers & Tablets / Smart Home & Connected L...,Manual,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,Hikvision,399.0,493,,Limited (6 months),,,,0.0,,,
2,10325354918,Fashion / Accessories / Scarves,,ZEE 3-in-1 Unisex Gaiter,ZEE,139.0,467,,Limited (6 months),,Grey,,0.0,,,
3,27131187035,Beauty / Luxury Beauty / Makeup / Face / Found...,,Estee Lauder Double Wear Stay In Place Makeup,Estee Lauder,655.0,275,,Non-Returnable,South Africa,Fresco,,0.0,,,
4,27131187035,Beauty / Luxury Beauty / Shop By Brand / Estee...,,Estee Lauder Double Wear Stay In Place Makeup,Estee Lauder,655.0,275,,Non-Returnable,South Africa,Fresco,,0.0,,,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1157,TAL00035388021,Baby & Toddler / Nappies & Changing / Changing...,x 3 Nappy Bin Refills,Angelcare - Nappy Bin Refill - 3 Pack,Angelcare,269.0,220,,Limited (6 months),South Africa,Blue,,0.0,,,
1158,TAL00035388021,Baby & Toddler / Nappies & Changing / Changing...,x 3 Nappy Bin Refills,Angelcare - Nappy Bin Refill - 3 Pack,Angelcare,269.0,220,,Limited (6 months),South Africa,Blue,,0.0,,,
1159,TAL00035388407,Baby & Toddler / Nappies & Changing / Wipes,384 Complete Clean Wipes,Pampers Complete Clean Baby Wipes - 6 x 64 - 3...,Pampers,159.0,130,,Non-Returnable (6 months),South Africa,White,,0.0,"19,8","21,3","3,2"
1160,TAL00035394505,Computers & Tablets / Smart Home & Connected L...,1 x UPS,RCT 650VA Line Interactive UPS,RCT,675.0,410,,Limited (12 months),South Africa,,,"10,72678",,,
1161,TAL00035395957,Cameras / Cameras & Lenses / Camera Accessorie...,,Fujifilm Instax Film plain - Pack of 10,Fujifilm Instax,155.0,119,,Limited (12 months),South Africa,,,0.0,,,

### 6. Normalize the given Database tables to the 1st Normal Form (1NF)

Given the below below target ERD create new tables such the the database conforms to the 1st Normal Form

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/1NF.png" alt="1st Normal Form ERD" border="0">

It is suggested that you create all your tables before attempting to populate them with data, this will help reduce errors that might creep up due to logical dependencies.

#### 6.1 Create the tables required for the 1st Normal Form
Use the above ERD sketch to create the required tables. Please label your tables as they appear in the ERD sketch

In [9]:
%%read_sql
--#Create tables required for 1NF
DROP TABLE IF EXISTS Transactions_1NF;
DROP TABLE IF EXISTS Products_1NF;
-- Create Transactions_1NF table

CREATE TABLE Transactions_1NF(
    CartID      INTEGER NOT NULL,
    Barcode     VARCHAR(150) NOT NULL,
    UserName    VARCHAR(150) NOT NULL,
    InvoiceDate DATETIME NOT NULL,
    Total       REAL NOT NULL,
    
    PRIMARY KEY(CartID,Barcode)

);

-- Create Products_1NF table
CREATE TABLE Products_1NF(
    Barcode            VARCHAR(150) NOT NULL,
    NavigationPath     VARCHAR(150) NOT NULL,
    ItemDescription    VARCHAR(150) NOT NULL,
    ProductDescription VARCHAR(150) NOT NULL,
    Brand              VARCHAR(150),
    Price              REAL NOT NULL,
    Quantity           INTEGER NOT NULL,
    PackType           VARCHAR(150),
    Warranty           VARCHAR(150),
    StockCountry       VARCHAR(150),
    Colour             VARCHAR(150),
    Weight_kg          REAL,
    Volume_litre       REAL,
    Length             REAL,
    Width              REAL,
    Height             REAL,
    
    PRIMARY KEY(Barcode,NavigationPath,ItemDescription)
    );

Query started at 05:10:44 PM SAST; Query executed in 0.00 m

#### 6.2 Populate the tables you have create in the above section.

Populate the tables such that the database conforms to the 1st Normal Form

In [18]:
%%read_sql
--#Populate the 1NF tables
 INSERT INTO Transactions_1NF(CartID,Barcode,UserName,InvoiceDate,Total)
SELECT distinct CartID, Barcode, UserName, InvoiceDate, Total
FROM Transactions;

-- Populate Products_1NF table
/*Replace the commas (in Weight_kg,Volume_litre,Length,Width,Height) with fullstops
in order to make the values consistent.*/

INSERT INTO Products_1NF(Barcode,NavigationPath,ItemDescription,ProductDescription,Brand,
                         Price,Quantity,PackType,Warranty,StockCountry,Colour,Weight_kg,
                         Volume_litre,Length,Width,Height)

SELECT distinct Barcode,NavigationPath,ItemDescription,ProductDescription,Brand,
       Price,Quantity,PackType,Warranty,StockCountry,Colour,
       
       Replace(Weight_kg,',','.') AS Weight_kg,
       Replace(Volume_litre,',','.') AS Volume_litre,
       Replace(Length,',','.') Length,
       Replace(Width,',','.') AS Width,
       Replace(Height,',','.') AS Height
       
FROM Products
WHERE Length LIKE '%,%' OR Width LIKE '%,%' OR Height LIKE '%,%' OR Weight_kg LIKE '%,%'
        OR Volume_litre like '%,%' 

UNION 

SELECT distinct Barcode,NavigationPath,ItemDescription,ProductDescription,Brand,
       Price,Quantity,PackType,Warranty,StockCountry,Colour,Weight_kg,
       Volume_litre,Length,Width,Height
FROM Products
WHERE Length not LIKE '%,%' and Width not LIKE '%,%' and Height not LIKE '%,%' and Weight_kg not LIKE '%,%'
        and Volume_litre not LIKE '%,%'

Query started at 05:25:31 PM SAST; Query executed in 0.00 m

###  7. Convert the database into its 2nd Normal Form (2NF).

Please label your tables as they appear in the ERD sketch.

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/2NF.png" alt="2nd Normal Form ERD" border="0">

In [19]:
%%read_sql
--#Create tables required for 2NF

DROP TABLE IF EXISTS Transactions_2NF;
DROP TABLE IF EXISTS Products_2NF;
DROP TABLE IF EXISTS Navigation_2NF;
DROP TABLE IF EXISTS PackageContents_2NF;
DROP TABLE IF EXISTS Colours_2NF;

--Create Transactions_2NF table

CREATE TABLE Transactions_2NF(
    CartID         INTEGER NOT NULL ,
    Barcode        VARCHAR(150) NOT NULL,
    UserName       VARCHAR(150) NOT NULL,
    InvoiceDate    DATETIME NOT NULL,
    Total          REAL NOT NULL ,
    
    PRIMARY KEY(CartID,Barcode)
); 

-- Create Navigation_2NF table
CREATE TABLE Navigation_2NF(
    PathID          INTEGER NOT NULL, 
    NavigationPath  VARCHAR(150),
    PRIMARY KEY(PathID AUTOINCREMENT)

);

-- Create PackageContents_2NF table
CREATE TABLE PackageContents_2NF(
    ItemID            INTEGER NOT NULL,
    ItemDescription   VARCHAR(150),
    PackType          VARCHAR(150),
    Warranty          VARCHAR(150),
    PRIMARY KEY(ItemID AUTOINCREMENT)

);

-- Create Colours_2NF table
CREATE TABLE Colours_2NF(
    ColourID    INTEGER NOT NULL, 
    Colour      VARCHAR(150),
    PRIMARY KEY(ColourID AUTOINCREMENT)

);

-- Create Products_2NF table
CREATE TABLE Products_2NF(
    RegistryID         INTEGER NOT NULL,
    Barcode            VARCHAR(150) NOT NULL,
    ProductDescription VARCHAR(150) NOT NULL,
    Brand              VARCHAR(150),
    Price              REAL NOT NULL,
    Quantity           INTEGER NOT NULL,
    StockCountry       VARCHAR(150),
    Weight_kg          REAL,
    Volume_litre       REAL,
    Length             REAL,
    Width              REAL,
    Height             REAL,
    PathID             INTEGER ,
    ItemID             INTEGER ,
    ColourID           INTEGER ,
    
    FOREIGN KEY(Barcode)  REFERENCES Transactions_2NF(Barcode),
    FOREIGN KEY(PathID)   REFERENCES Navigation_2NF(PathID),
    FOREIGN KEY(ItemID)   REFERENCES PackageContents_2NF(ItemID),
    FOREIGN KEY(ColourID) REFERENCES Colours_2NF(ColourID),
    PRIMARY KEY(RegistryID AUTOINCREMENT) 
);

Query started at 05:27:20 PM SAST; Query executed in 0.00 m

In [20]:
%%read_sql
-- #Populate the tables so that they conform to 2NF

-- #Populate the tables so that they conform to 2NF
INSERT INTO Transactions_2NF(CartID,Barcode,UserName,InvoiceDate,Total)
SELECT DISTINCT CartID,Barcode,UserName,InvoiceDate,Total
FROM Transactions_1NF;

-- Populate Navigation_2NF table
INSERT INTO Navigation_2NF(NavigationPath)
SELECT DISTINCT NavigationPath
FROM Products_1NF
WHERE NavigationPath != ''; 

-- Populate PackageContents_2NF table
INSERT INTO PackageContents_2NF(ItemDescription,PackType,Warranty)
SELECT DISTINCT ItemDescription,PackType,Warranty
FROM Products_1NF
WHERE ItemDescription !='';

-- Populate Colours_2NF table
INSERT INTO Colours_2NF(Colour)
select distinct Colour
from Products_1NF
WHERE Colour !=''; 

-- Populate Products_2NF table

INSERT INTO Products_2NF(Barcode,ProductDescription,Brand,Price,Quantity,
                         StockCountry,Weight_kg,Volume_litre,Length,Width,Height,
                         PathID,ItemID,ColourID )
-- 

select distinct p1.Barcode,ProductDescription,Brand,Price,Quantity,
        StockCountry,Weight_kg,Volume_litre,Length,Width,Height,PathID,ItemID,ColourID 
                         
from Products_1NF as p1
 Left join Navigation_2NF as n2
on p1.NavigationPath=n2.NavigationPath
  Left join PackageContents_2NF as pc2
on p1.ItemDescription=pc2.ItemDescription
 Left join Colours_2NF as c
  on p1.Colour=c.Colour
Left join Transactions_2NF as t2
on p1.Barcode=t2.Barcode

Query started at 05:29:40 PM SAST; Query executed in 0.00 m

<a id='Target_ERD'></a>
### 8. Convert the table into its 3rd Normal Form (3NF)

Please label your tables as they appear in the ERD sketch

<br>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/3NF.png" alt="3rd Normal Form ERD" border="0"></a>

In [22]:
%%read_sql

--#Create tables required for 2NF

DROP TABLE IF EXISTS Transactions_3NF;
DROP TABLE IF EXISTS Products_3NF;
DROP TABLE IF EXISTS Navigation_3NF;
DROP TABLE IF EXISTS PackageContents_3NF;
DROP TABLE IF EXISTS Colours_3NF;
DROP TABLE IF EXISTS Users_3NF;
DROP TABLE IF EXISTS Brands_3NF;
DROP TABLE IF EXISTS Locations_3NF; 

-- Create Navigation_3NF table
CREATE TABLE Navigation_3NF AS 
   SELECT * FROM Navigation_2NF; 


-- Create PackageContents_3NF table
CREATE TABLE PackageContents_3NF AS
  SELECT * FROM PackageContents_2NF;

-- Create Colours_3NF table
CREATE TABLE Colours_3NF AS
  SELECT * FROM Colours_2NF;

--Create Transactions_3NF table
CREATE TABLE Transactions_3NF(
    CartID         INTEGER NOT NULL,
    Barcode        VARCHAR(150) NOT NULL,
    UserID         INTEGER NOT NULL,
    InvoiceDate    DATETIME NOT NULL,
    Total          REAL NOT NULL,
    
    FOREIGN KEY(UserID) REFERENCES Users_3NF(UserID),
    PRIMARY KEY(CartID,Barcode)
);


--Create Users_3NF table
CREATE TABLE Users_3NF(
    UserID    INTEGER NOT NULL,
    UserName  VARCHAR(150) NOT NULL,
    PRIMARY KEY(UserID AUTOINCREMENT)
);


-- Create Brands_3NF table
CREATE TABLE Brands_3NF(
    BrandID    INTEGER NOT NULL,
    Brand      VARCHAR(150),
    PRIMARY KEY(BrandID AUTOINCREMENT)
);

-- Create Locations_3NF table
CREATE TABLE Locations_3NF(
    LocationID     INTEGER NOT NULL,
    StockCountry   VARCHAR(150),
    PRIMARY KEY(LocationID AUTOINCREMENT)
);

-- Create Products_3NF table
CREATE TABLE Products_3NF(
    RegistryID         INTEGER NOT NULL, 
    Barcode            VARCHAR(150) NOT NULL,
    ProductDescription VARCHAR(150) NOT NULL,
    Price              REAL NOT NULL,
    Quantity           INTEGER NOT NULL,
    Weight_kg          REAL,
    Volume_litre       REAL,
    Length             REAL,
    Width              REAL,
    Height             REAL,
    PathID            INTEGER,
    ItemID            INTEGER,
    ColourID          INTEGER,
    BrandID           INTEGER,
    LocationID        INTEGER,
    
    FOREIGN KEY(Barcode)     REFERENCES Transactions_3NF(Barcode)
    FOREIGN KEY(PathID)      REFERENCES Navigation_3NF(PathID),
    FOREIGN KEY(ItemID)      REFERENCES PackageContents_3NF(ItemID),
    FOREIGN KEY(ColourID)    REFERENCES Colours_3NF(ColourID),
    FOREIGN KEY(BrandID)     REFERENCES Brands_3NF(BrandID),
    FOREIGN KEY(LocationID)  REFERENCES Locations_3NF(LocationID),
    PRIMARY KEY(RegistryID AUTOINCREMENT)
);

Query started at 05:32:38 PM SAST; Query executed in 0.00 m

In [32]:
%%read_sql

--# Populate the tables to that they conform to the 3rd Normal Form
-- Populate the Users_3NF table
INSERT INTO Users_3NF (UserName)
SELECT DISTINCT UserName 
FROM Transactions_2NF
WHERE UserName != '';

-- Populate the Brands_3NF table
INSERT INTO Brands_3NF (Brand)
SELECT DISTINCT Brand 
FROM Products_2NF
WHERE Brand != '';

-- Populate the Locations_3NF table
INSERT INTO Locations_3NF (StockCountry)
SELECT DISTINCT StockCountry 
FROM Products_2NF
WHERE StockCountry != ''; 

-- Populate the Transactions_3NF table
INSERT INTO Transactions_3NF(CartID,Barcode,UserID,InvoiceDate,Total)
SELECT Distinct CartID,Barcode,UserID,InvoiceDate,Total 
FROM Transactions_2NF as t
join Users_3NF as u
 on t.UserName=u.UserName;

 -- Populate the Products_3NF
INSERT INTO Products_3NF(Barcode,ProductDescription,Price,Quantity,Weight_kg,
                          Volume_litre,Length,Width,Height,PathID,ItemID,ColourID,BrandID,LocationID)
               
SELECT Distinct prod2.Barcode,ProductDescription,Price,Quantity,Weight_kg,
       Volume_litre,Length,Width,Height,prod2.PathID,prod2.ItemID,
       prod2.ColourID,BrandID,LocationID
      
       
FROM Products_2NF as prod2
left JOIN Transactions_3NF as t3 on prod2.Barcode=t3.Barcode

left JOIN Navigation_3NF as n3 on prod2.PathID=n3.PathID

left JOIN PackageContents_3NF as pc3 on prod2.ItemID=pc3.ItemID

left JOIN Colours_3NF as c on prod2.ColourID=c.ColourID

left JOIN Brands_3NF as b on prod2.Brand=b.Brand 

left JOIN Locations_3NF as l on prod2.StockCountry=l.StockCountry;

Query started at 05:38:58 PM SAST; Query executed in 0.00 m

<a id='MCQ_questions'></a>
## 9. MCQ Questions

Having completed the normalisation of the database, you may use the following cells to help you answer the MCQs for the predict.

Q1) How many unique products does the company have?

In [178]:
%%read_sql
-- Write your query here:
select count(RegistryID)
from Products_3NF

Query started at 09:43:17 PM SAST; Query executed in 0.00 m

   count(RegistryID)
0               1214

Q2) How many users bought from Bhejane in April 2020?

In [186]:
%%read_sql
-- Write your query here:
--Please note that i could not get the listed answers so i picked the closest tothe one i have. 
select count(DISTINCT UserID)
FROM Transactions_3NF 
where InvoiceDate >= '2020-04-01' AND InvoiceDate <= '2020-04-30'

Query started at 09:50:11 PM SAST; Query executed in 0.00 m

   count(DISTINCT UserID)
0                      30

Q3) How many users bought three or more items whose combined total was more than R1000 in a single transaction?

In [175]:
%%read_sql
-- Write your query here:
/*PLease note that i couldnt get any of the listed answers so i picked the closest to the one i have */
With CTE AS(
select UserID,count(Barcode) as c,Total
FROM Transactions_3NF
group by UserID
having c>=3 and Total>1000)

SELECT count(UserID)
from CTE

Query started at 09:40:24 PM SAST; Query executed in 0.00 m

   count(UserID)
0             12

Q4) Which user(s) made the largest purchase on a sinlge transaction?

In [126]:
%%read_sql
-- Write your query here
select CartID,UserID,UserName,Total
FROM Transactions_3NF
join Users_3NF 
 USING(UserID)
order by Total DESC

Query started at 08:11:39 PM SAST; Query executed in 0.00 m

     CartID  UserID       UserName    Total
0       123      11         Mandla  10999.0
1       124      47       Brigette  10999.0
2       125      45  Andreas Peter   3765.0
3       126     120        Mzoxolo   3765.0
4       179       4         Zanele   3464.0
..      ...     ...            ...      ...
273      39      57          Wayne     23.0
274      44      59         Janine     13.0
275      60      12          Cindy     12.0
276      93     110       Michelle     10.0
277      37      54         Ridhaa      1.0

[278 rows x 4 columns]

Q5) How many components does the product: "5m Colour Changing RGB LED Strip Light" (MPTAL57588104) come with?

In [52]:
%%read_sql
-- Write your query here
select COUNT(distinct ItemDescription)
FROM Products_3NF 
JOIN PackageContents_3NF
USING(ItemID)

WHERE Barcode='MPTAL57588104'

Query started at 06:05:35 PM SAST; Query executed in 0.00 m

   COUNT(distinct ItemDescription)
0                                4

Q6) How many brands are available at Bhejane?

In [159]:
%%read_sql
-- Write your query here:
select count(BrandID)
from Brands_3NF

Query started at 09:13:35 PM SAST; Query executed in 0.00 m

   count(BrandID)
0             232

7) What is the price of the "Verimark - Floorwiz 2in1 Mop"?

In [53]:
%%read_sql
-- Write your query here:
SELECT Price
from Products_3NF
where ProductDescription='Verimark - Floorwiz 2in1 Mop'

Query started at 06:07:46 PM SAST; Query executed in 0.00 m

   Price
0  179.0
1  179.0
2  179.0

Q8) Calculate the package volume of the "Russell Hobbs - Slow Cooker" using the given dimensions. Round your answer to the nearest integer and ignore units for the calculation.

In [169]:
%%read_sql
-- Write your query here:
/*Please note that i coudnt get any of the answers given in the multiple
choice and so i picked the closest answer to what i have which is 26928 on the listed answers*/

select Length,Width,Height, (Length*Width*Height) as volume
from Products_3NF
JOIN PackageContents_3NF USING(ItemID)
WHERE ProductDescription = 'Russell Hobbs - Slow Cooker'

Query started at 09:31:28 PM SAST; Query executed in 0.00 m

   Length  Width  Height   volume
0    24.0   34.0    33.4  27254.4
1    24.0   34.0    33.4  27254.4
2    24.0   34.0    33.4  27254.4
3    24.0   34.0    33.4  27254.4

Q9) Which user made the most transactions in the Year 2020?

In [65]:
%%read_sql
-- Write your query here:
WITH CTE AS(
 select userID,COUNT(Barcode) as c 
 from Transactions_3NF
 where SUBSTR(InvoiceDate,1,4)='2020'
 group by userID)
 
 select UserName,userID,max(c)
 from CTE
 JOIN Users_3NF
 USING (UserID)

Query started at 06:48:30 PM SAST; Query executed in 0.00 m

   UserName  userID  max(c)
0  Cornelis      21       9

Q10) What is the total number of recorded users that shop at Bhejane?

In [168]:
%%read_sql
-- Write your query here:
/* please note that i did not get the answers listed so i picked the closest to the one 
i have which is 158 on the listed answers */
select count(UserId)
FROM Users_3NF

Query started at 09:27:40 PM SAST; Query executed in 0.00 m

   count(UserId)
0            160

Q11) What is the record count for the Colours_3NF Table?

In [77]:
%%read_sql
-- Write your query here:
SELECT count(ColourID)
FROM Colours_3NF

Query started at 07:00:01 PM SAST; Query executed in 0.00 m

   count(ColourID)
0               17

Q12) What would the total price be if I had the following items in my cart?
* MPTAL57588104
* 5000394203921
* 6932391917652

In [82]:
%%read_sql
-- Write your query here
WITH CTE AS 
(SELECT distinct Barcode,Price 
from Products_3NF
where Barcode in ('MPTAL57588104','5000394203921','6932391917652'))

select sum(Price)
from CTE

Query started at 07:06:25 PM SAST; Query executed in 0.00 m

   sum(Price)
0       734.0

Q13) What is the barcode of the most sold product?

In [163]:
%%read_sql

-- Write your query here

select Barcode,count(Barcode) as c
from Transactions_3NF
Group by Barcode
order by c desc
limit 2

Query started at 09:21:39 PM SAST; Query executed in 0.00 m

         Barcode  c
0  4015400541813  4
1  MPTAL00404857  3

Q14) What are the products of Cornelis’ cart on the 2020-06-28 0:00:00?

In [94]:
%%read_sql
-- Write your query here:
SELECT distinct ProductDescription
from Users_3NF
join Transactions_3NF
USING(UserID)
JOIN Products_3NF
USING(Barcode)
Where UserName='Cornelis' and InvoiceDate='2020-06-28 0:00:00'

Query started at 07:27:05 PM SAST; Query executed in 0.00 m

                                  ProductDescription
0   Dettol Body Wash - Shower Gel - Original - 600ml
1                       Vitality Aloe Vera Gel 100ml
2  Sparq Active Resistance Loop Band - Set of 5 w...
3                             Protective Face Shield

Q15) Which users bought locally produced, black-coloured products on odd-numbered months of the year, and what was the total cost (rounded to the nearest integer) of these products?

In [144]:
%%read_sql

--Write your query here
-- Kindly note that I've only shown the total but to see the usernames, you can use this query: select UserName from CTE
WITH CTE AS
(select Distinct(UserName),Total
from Users_3NF
JOIN Transactions_3NF
 USING(UserID)
JOIN Products_3NF
 USING(Barcode)
JOIN Locations_3NF
 USING(LocationID)
Join Colours_3NF
 USING(ColourID)

WHERE StockCountry='South Africa' 
 AND Colour='Black'
 And substr(InvoiceDate,1,7) IN ('2020-01','2020-03','2020-05','2020-07','2020-09','2020-11')
 )
 
SELECT sum(Total)
from CTE

Query started at 08:48:12 PM SAST; Query executed in 0.00 m

   sum(Total)
0      5580.0

In [146]:
%%read_sql
-- scratch work
select * from Colours_3NF
limit 1

Query started at 08:53:25 PM SAST; Query executed in 0.00 m

   ColourID Colour
0         1   Grey

In [145]:
%%read_sql
---scratch work
--,'03','05','07','09','11'

select substr(InvoiceDate,1,7)
from Transactions_3NF

LIMIT 1

Query started at 08:52:51 PM SAST; Query executed in 0.00 m

  substr(InvoiceDate,1,7)
0                 2020-07